stm32-rs/stm32f3xx-hal/src/gpio.rs
#[cfg(feature = "stm32f303")]
gpio!(GPIOF, gpiof, gpiob, iopfen, iopfrst, PFx, [
    PF0: (pf0, 0, Input<Floating>, AFRL),
    PF1: (pf1, 1, Input<Floating>, AFRL),
    PF2: (pf2, 2, Input<Floating>, AFRL),
    PF3: (pf3, 3, Input<Floating>, AFRL),
    PF4: (pf4, 4, Input<Floating>, AFRL),
    PF5: (pf5, 5, Input<Floating>, AFRL),
    PF6: (pf6, 6, Input<Floating>, AFRL),
    PF7: (pf7, 7, Input<Floating>, AFRL),
    PF8: (pf8, 8, Input<Floating>, AFRH),
    PF9: (pf9, 9, Input<Floating>, AFRH),
    PF10: (pf10, 10, Input<Floating>, AFRH),
    PF11: (pf11, 11, Input<Floating>, AFRH),
    PF12: (pf12, 12, Input<Floating>, AFRH),
    PF13: (pf13, 13, Input<Floating>, AFRH),
    PF14: (pf14, 14, Input<Floating>, AFRH),
    PF15: (pf15, 15, Input<Floating>, AFRH),
]);

#[cfg(any(feature = "stm32f373", feature = "stm32f378"))]
gpio!(GPIOF, gpiof, gpioc, iopfen, iopfrst, PFx, [
    PF0: (pf0, 0, Input<Floating>, AFRL),
    PF1: (pf1, 1, Input<Floating>, AFRL),
    PF2: (pf2, 2, Input<Floating>, AFRL),
    PF4: (pf4, 4, Input<Floating>, AFRL),
    PF6: (pf6, 6, Input<Floating>, AFRL),
    PF7: (pf7, 7, Input<Floating>, AFRL),
    PF9: (pf9, 9, Input<Floating>, AFRH),
    PF10: (pf10, 10, Input<Floating>, AFRH),
]);

#[cfg(any(feature = "stm32f328", feature = "stm32f358", feature = "stm32f398"))]
gpio!(GPIOF, gpiof, gpioc, iopfen, iopfrst, PFx, [
    PF0: (pf0, 0, Input<Floating>, AFRL),
    PF1: (pf1, 1, Input<Floating>, AFRL),
    PF2: (pf2, 2, Input<Floating>, AFRL),
    PF3: (pf3, 3, Input<Floating>, AFRL),
    PF4: (pf4, 4, Input<Floating>, AFRL),
    PF5: (pf5, 5, Input<Floating>, AFRL),
    PF6: (pf6, 6, Input<Floating>, AFRL),
    PF7: (pf7, 7, Input<Floating>, AFRL),
    PF8: (pf8, 8, Input<Floating>, AFRH),
    PF9: (pf9, 9, Input<Floating>, AFRH),
    PF10: (pf10, 10, Input<Floating>, AFRH),
    PF11: (pf11, 11, Input<Floating>, AFRH),
    PF12: (pf12, 12, Input<Floating>, AFRH),
    PF13: (pf13, 13, Input<Floating>, AFRH),
    PF14: (pf14, 14, Input<Floating>, AFRH),
    PF15: (pf15, 15, Input<Floating>, AFRH),
]);

#[cfg(feature = "stm32f303")]
gpio!(GPIOG, gpiog, gpiob, iopgen, iopgrst, PGx, [
    PG0: (pg0, 0, Input<Floating>, AFRL),
    PG1: (pg1, 1, Input<Floating>, AFRL),
    PG2: (pg2, 2, Input<Floating>, AFRL),
    PG3: (pg3, 3, Input<Floating>, AFRL),
    PG4: (pg4, 4, Input<Floating>, AFRL),
    PG5: (pg5, 5, Input<Floating>, AFRL),
    PG6: (pg6, 6, Input<Floating>, AFRL),
    PG7: (pg7, 7, Input<Floating>, AFRL),
    PG8: (pg8, 8, Input<Floating>, AFRH),
    PG9: (pg9, 9, Input<Floating>, AFRH),
    PG10: (pg10, 10, Input<Floating>, AFRH),
    PG11: (pg11, 11, Input<Floating>, AFRH),
    PG12: (pg12, 12, Input<Floating>, AFRH),
    PG13: (pg13, 13, Input<Floating>, AFRH),
    PG14: (pg14, 14, Input<Floating>, AFRH),
    PG15: (pg15, 15, Input<Floating>, AFRH),
]);

#[cfg(feature = "stm32f303")]
gpio!(GPIOH, gpioh, gpiob, iophen, iophrst, PHx, [
    PH0: (ph0, 0, Input<Floating>, AFRL),
    PH1: (ph1, 1, Input<Floating>, AFRL),
    PH2: (ph2, 2, Input<Floating>, AFRL),
    PH3: (ph3, 3, Input<Floating>, AFRL),
    PH4: (ph4, 4, Input<Floating>, AFRL),
    PH5: (ph5, 5, Input<Floating>, AFRL),
    PH6: (ph6, 6, Input<Floating>, AFRL),
    PH7: (ph7, 7, Input<Floating>, AFRL),
    PH8: (ph8, 8, Input<Floating>, AFRH),
    PH9: (ph9, 9, Input<Floating>, AFRH),
    PH10: (ph10, 10, Input<Floating>, AFRH),
    PH11: (ph11, 11, Input<Floating>, AFRH),
    PH12: (ph12, 12, Input<Floating>, AFRH),
    PH13: (ph13, 13, Input<Floating>, AFRH),
    PH14: (ph14, 14, Input<Floating>, AFRH),
    PH15: (ph15, 15, Input<Floating>, AFRH),
]);
